{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[STOP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SPACE]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[STOP]": 0,
      "[UNK]": 1,
      "[SPACE]": 2,
      "!": 3,
      "'": 4,
      "(": 5,
      ")": 6,
      ",": 7,
      "-": 8,
      ".": 9,
      "/": 10,
      ":": 11,
      ";": 12,
      "?": 13,
      "a": 14,
      "b": 15,
      "c": 16,
      "d": 17,
      "e": 18,
      "f": 19,
      "g": 20,
      "h": 21,
      "i": 22,
      "j": 23,
      "k": 24,
      "l": 25,
      "m": 26,
      "n": 27,
      "o": 28,
      "p": 29,
      "q": 30,
      "r": 31,
      "s": 32,
      "t": 33,
      "u": 34,
      "v": 35,
      "w": 36,
      "x": 37,
      "y": 38,
      "z": 39,
      "ni": 40,
      "wo": 41,
      "un": 42,
      "ti": 43,
      "aa": 44,
      "won": 45,
      "gb": 46,
      "lo": 47,
      "an": 48,
      "le": 49,
      "se": 50,
      "ko": 51,
      "ri": 52,
      "si": 53,
      "awon": 54,
      "mo": 55,
      "la": 56,
      "ra": 57,
      "ba": 58,
      "re": 59,
      "to": 60,
      "wa": 61,
      "in": 62,
      "mi": 63,
      "je": 64,
      "ile": 65,
      "ro": 66,
      "naa": 67,
      "pa": 68,
      "maa": 69,
      "gba": 70,
      "so": 71,
      "jo": 72,
      "de": 73,
      "yo": 74,
      "ya": 75,
      "ta": 76,
      "fun": 77,
      "gbe": 78,
      "lu": 79,
      "bi": 80,
      "ki": 81,
      "rin": 82,
      "pe": 83,
      "gbo": 84,
      "ye": 85,
      "ju": 86,
      "po": 87,
      "bo": 88,
      "da": 89,
      "fi": 90,
      "be": 91,
      "ke": 92,
      "ja": 93,
      "kan": 94,
      "di": 95,
      "yoo": 96,
      "nu": 97,
      "eni": 98,
      "ati": 99,
      "fe": 100,
      "we": 101,
      "ran": 102,
      "ma": 103,
      "lati": 104,
      "ru": 105,
      "omo": 106,
      "ji": 107,
      "ka": 108,
      "mu": 109,
      "na": 110,
      "do": 111,
      "kun": 112,
      "sa": 113,
      "te": 114,
      "gun": 115,
      "ise": 116,
      "fo": 117,
      "yi": 118,
      "oko": 119,
      "tun": 120,
      "yan": 121,
      "ninu": 122,
      "run": 123,
      "bu": 124,
      "ku": 125,
      "me": 126,
      "iya": 127,
      "dun": 128,
      "olo": 129,
      "olu": 130,
      "ge": 131,
      "iwe": 132,
      "gi": 133,
      "ori": 134,
      "ana": 135,
      "su": 136,
      "ala": 137,
      "beeni": 138,
      "yin": 139,
      "igba": 140,
      "fu": 141,
      "tu": 142,
      "oun": 143,
      "li": 144,
      "hun": 145,
      "owo": 146,
      "ara": 147,
      "ojo": 148,
      "yen": 149,
      "bin": 150,
      "du": 151,
      "ga": 152,
      "binrin": 153,
      "oni": 154,
      "san": 155,
      "koo": 156,
      "yii": 157,
      "ola": 158,
      "aso": 159,
      "aye": 160,
      "kunrin": 161,
      "pu": 162,
      "baba": 163,
      "sise": 164,
      "ero": 165,
      "igbe": 166,
      "ounje": 167,
      "opo": 168,
      "dara": 169,
      "eko": 170,
      "fa": 171,
      "sin": 172,
      "odun": 173,
      "tan": 174,
      "pelu": 175,
      "oju": 176,
      "gbogbo": 177,
      "ere": 178,
      "ohun": 179,
      "eniyan": 180,
      "ose": 181,
      "yara": 182,
      "egbe": 183,
      "wu": 184,
      "nai": 185,
      "ogun": 186,
      "ede": 187,
      "laa": 188,
      "agba": 189,
      "lori": 190,
      "nigba": 191,
      "koko": 192,
      "omi": 193,
      "iwa": 194,
      "ibi": 195,
      "go": 196,
      "ilu": 197,
      "obinrin": 198,
      "inu": 199,
      "okunrin": 200,
      "rara": 201,
      "sun": 202,
      "lowo": 203,
      "ipa": 204,
      "nje": 205,
      "lola": 206,
      "lopo": 207,
      "ria": 208,
      "ijo": 209,
      "gbon": 210,
      "lan": 211,
      "agbe": 212,
      "ake": 213,
      "naiji": 214,
      "yawo": 215,
      "naijiria": 216,
      "din": 217,
      "feran": 218,
      "tuntun": 219,
      "iba": 220,
      "koja": 221,
      "ipe": 222,
      "ifo": 223,
      "ina": 224,
      "igi": 225,
      "ruba": 226,
      "ade": 227,
      "oro": 228,
      "ona": 229,
      "nipa": 230,
      "id": 231,
      "irun": 232,
      "ofu": 233,
      "igbeyawo": 234,
      "lanaa": 235,
      "toju": 236,
      "ee": 237,
      "iro": 238,
      "rufu": 239,
      "emi": 240,
      "iwo": 241,
      "bere": 242,
      "yoruba": 243,
      "atijo": 244,
      "akekoo": 245,
      "lana": 246,
      "ele": 247,
      "osu": 248,
      "ofurufu": 249,
      "isi": 250,
      "irin": 251,
      "oluko": 252,
      "opolopo": 253,
      "tabi": 254
    },
    "merges": [
      "n i",
      "w o",
      "u n",
      "t i",
      "a a",
      "wo n",
      "g b",
      "l o",
      "a n",
      "l e",
      "s e",
      "k o",
      "r i",
      "s i",
      "a won",
      "m o",
      "l a",
      "r a",
      "b a",
      "r e",
      "t o",
      "w a",
      "i n",
      "m i",
      "j e",
      "i le",
      "r o",
      "n aa",
      "p a",
      "m aa",
      "gb a",
      "s o",
      "j o",
      "d e",
      "y o",
      "y a",
      "t a",
      "f un",
      "gb e",
      "l u",
      "b i",
      "k i",
      "ri n",
      "p e",
      "gb o",
      "y e",
      "j u",
      "p o",
      "b o",
      "d a",
      "f i",
      "b e",
      "k e",
      "j a",
      "k an",
      "d i",
      "yo o",
      "n u",
      "e ni",
      "a ti",
      "f e",
      "w e",
      "r an",
      "m a",
      "la ti",
      "r u",
      "o mo",
      "j i",
      "k a",
      "m u",
      "n a",
      "d o",
      "k un",
      "s a",
      "t e",
      "g un",
      "i se",
      "f o",
      "y i",
      "o ko",
      "t un",
      "y an",
      "ni nu",
      "r un",
      "b u",
      "k u",
      "m e",
      "i ya",
      "d un",
      "o lo",
      "o lu",
      "g e",
      "i we",
      "g i",
      "o ri",
      "an a",
      "s u",
      "a la",
      "be eni",
      "y in",
      "i gba",
      "f u",
      "t u",
      "o un",
      "l i",
      "h un",
      "o wo",
      "a ra",
      "o jo",
      "ye n",
      "b in",
      "d u",
      "g a",
      "bin rin",
      "o ni",
      "s an",
      "ko o",
      "yi i",
      "o la",
      "a so",
      "a ye",
      "kun rin",
      "p u",
      "ba ba",
      "si se",
      "e ro",
      "i gbe",
      "oun je",
      "o po",
      "da ra",
      "e ko",
      "f a",
      "si n",
      "o dun",
      "t an",
      "pe lu",
      "o ju",
      "gbo gbo",
      "e re",
      "o hun",
      "eni yan",
      "o se",
      "ya ra",
      "e gbe",
      "w u",
      "na i",
      "o gun",
      "e de",
      "l aa",
      "a gba",
      "lo ri",
      "ni gba",
      "ko ko",
      "o mi",
      "i wa",
      "i bi",
      "g o",
      "i lu",
      "o binrin",
      "in u",
      "o kunrin",
      "ra ra",
      "s un",
      "lo wo",
      "i pa",
      "n je",
      "lo la",
      "lo po",
      "ri a",
      "i jo",
      "gbo n",
      "l an",
      "a gbe",
      "a ke",
      "nai ji",
      "ya wo",
      "naiji ria",
      "d in",
      "fe ran",
      "tun tun",
      "i ba",
      "ko ja",
      "i pe",
      "i fo",
      "in a",
      "i gi",
      "ru ba",
      "a de",
      "o ro",
      "o na",
      "ni pa",
      "i d",
      "i run",
      "o fu",
      "igbe yawo",
      "lan aa",
      "to ju",
      "e e",
      "i ro",
      "ru fu",
      "e mi",
      "i wo",
      "be re",
      "yo ruba",
      "ati jo",
      "ake koo",
      "l ana",
      "e le",
      "o su",
      "ofu rufu",
      "i si",
      "i rin",
      "olu ko",
      "opo lopo",
      "ta bi"
    ]
  }
}